recipes/classic-italian-bread.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Classic Italian Bread</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="james" />
<link rel="stylesheet" type="text/css" href="../static/recipe.css" />
<link rel="icon" type="image/ico" href="../static/favicon.svg" />
</head>
<body>
<div id="org-div-home-and-up"> <a href="../index.html"> Home </a> </div> <div id="btns"><button id="copy-btn" onclick="copyTicked()"></button> <button id="untick-btn" onclick="untickAll()"></button></div><div id="notify">Copied!</div><div id="content">
<h1 class="title">Classic Italian Bread</h1>
<p>
<a href="http://www.girlversusdough.com/2014/09/18/classic-italian-bread/">Original link</a>
</p>

<div id="outline-container-org29271a3" class="outline-2">
<h2 id="org29271a3">Ingredients</h2>
<div class="outline-text-2" id="text-org29271a3">
<ul class="org-ul">
<li>2 1/4 teaspoons (1 packet) Red Star active dry yeast</li>
<li>1 teaspoon granulated sugar</li>
<li>1 cup warm water (about 45&deg;C)</li>
<li>2 1/2 cups bread or all-purpose flour</li>
<li>2 tablespoons olive oil</li>
<li>1 teaspoon salt</li>
</ul>
</div>
</div>

<div id="outline-container-orgfa2e028" class="outline-2">
<h2 id="orgfa2e028">Method</h2>
<div class="outline-text-2" id="text-orgfa2e028">
<ol class="org-ol">
<li>In a large bowl or bowl of a stand mixer, combine yeast, sugar and warm water. Let stand 5 minutes until yeast is foamy.</li>
<li>Add 2 cups flour, olive oil and salt. Stir with a wooden spoon or with a dough hook on low speed until a shaggy dough forms. Turn dough out onto a lightly floured surface and knead by hand 10 minutes, adding just enough of the remaining flour until a soft, smooth and elastic dough forms; OR, increase dough hook speed to medium and knead dough in stand mixer 5 minutes, adding just enough of the remaining flour until a soft, smooth and elastic dough forms.</li>
<li>Shape dough into a ball; place in an oiled bowl and turn to coat. Cover bowl with plastic wrap and let dough rise 1 hour until doubled.</li>
<li>Heat oven to 200&deg;C. Line a baking sheet with a silicone mat or lightly grease the surface with oil or cooking spray. On a lightly floured surface, punch down dough, then carefully shape into a batard/torpedo about 12 inches long. Transfer to prepared baking sheet. Cover with a tea towel and let rise another 20 minutes until puffy.</li>
<li>Use a serrated knife to make a few ¼-inch deep slits in the surface of the loaf. Bake loaf 20 minutes until golden brown. Cool completely on a cooling rack before slicing.</li>
</ol>
</div>
</div>
</div>
</body>
</html>
